# Задача 30:  Заполните массив элементами арифметической прогрессии. 
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры. 
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

a1 = int(input("введите первый элемент в массиве: "))
d = int(input("введите разность: "))
n = int(input("введите кол-во элементов в массиве: "))
array = []
array.append(a1)

for i in range(n-1):
    an = array[i] + d
    array.append(an)

for i in array:
    print(i)




