# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*

# 5
#     1 2 3 4 5
#     3
#     -> 1

N = int(input("введите кол-во элементов в массиве: "))
array = []
for i in range(N):
    Ai = int(input("введите элементы массива: "))
    array.append(Ai)
print(array)

X = int(input("введите чисто Х: "))
count = 0

for i in array:
    if X == i:
        count += 1
print(count)
